In [2]:
import sqlite3

conn = sqlite3.connect("mydb.db")
cursor = conn.cursor()

with open("2_build_schema.sql", "r") as f:
    sql_script = f.read()

cursor.executescript(sql_script)
conn.commit()

In [10]:
%load_ext sql
%sql sqlite:///mydb.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting to 'sqlite:///mydb.db'

In [11]:
%%sql
--Showing Data
SELECT
  *
FROM
  Departments

Running query in 'sqlite:///mydb.db'

+------+-----------------+--------+
| Code |       Name      | Budget |
+------+-----------------+--------+
|  14  |        IT       | 65000  |
|  37  |    Accounting   | 15000  |
|  59  | Human Resources | 240000 |
|  77  |     Research    | 55000  |
+------+-----------------+--------+

In [12]:
%%sql
--Showing Data
SELECT
  *
FROM
  Employees

Running query in 'sqlite:///mydb.db'

+-----------+-----------+-----------+------------+
|    SSN    |    Name   |  LastName | Department |
+-----------+-----------+-----------+------------+
| 123234877 |  Michael  |   Rogers  |     14     |
| 152934485 |   Anand   | Manikutty |     14     |
| 222364883 |   Carol   |   Smith   |     37     |
| 326587417 |    Joe    |  Stevens  |     37     |
| 332154719 | Mary-Anne |   Foster  |     14     |
| 332569843 |   George  |  ODonnell |     77     |
| 546523478 |    John   |    Doe    |     59     |
| 631231482 |   David   |   Smith   |     77     |
| 654873219 |   Zacary  |   Efron   |     59     |
| 745685214 |    Eric   | Goldsmith |     59     |
+-----------+-----------+-----------+------------+
Truncated to displaylimit of 10.

In [46]:
%%sql
--Select the name and last name of employees working for departments with second lowest budget.
SELECT e.Name, e.LastName
FROM Employees e 
WHERE e.Department = (
       SELECT sub.Code 
       FROM (SELECT * FROM Departments d ORDER BY d.budget LIMIT 2) sub 
       ORDER BY budget DESC LIMIT 1);

Running query in 'sqlite:///mydb.db'

+--------+----------+
|  Name  | LastName |
+--------+----------+
| George | ODonnell |
| David  |  Smith   |
+--------+----------+

In [37]:
%%sql
SELECT
  Departments.Name
FROM
  Employees
  INNER JOIN Departments ON Department = Code
GROUP BY
  Departments.Name
HAVING
  COUNT(*) > 2;

Running query in 'sqlite:///mydb.db'

+-----------------+
|       Name      |
+-----------------+
| Human Resources |
|        IT       |
+-----------------+

In [21]:
%%sql
-- Select all the data of employees whose last name begins with an "S"
SELECT
  *
FROM
  employees
WHERE
  LastName LIKE 'S%';

Running query in 'sqlite:///mydb.db'

+-----------+-------+----------+------------+
|    SSN    |  Name | LastName | Department |
+-----------+-------+----------+------------+
| 222364883 | Carol |  Smith   |     37     |
| 326587417 |  Joe  | Stevens  |     37     |
| 631231482 | David |  Smith   |     77     |
| 845657246 | Kumar |  Swamy   |     14     |
+-----------+-------+----------+------------+

In [23]:
%%sql
-- Select the number of employees in each department (you only need to show the department code and the number of employees)
SELECT
  Department,
  COUNT(*) AS Nums
FROM
  Employees
GROUP BY
  Department

Running query in 'sqlite:///mydb.db'

+------------+------+
| Department | Nums |
+------------+------+
|     14     |  5   |
|     37     |  2   |
|     59     |  3   |
|     77     |  2   |
+------------+------+

In [24]:
%%sql
-- Select all the data of employees, including each employee's department's data
SELECT
  *
FROM
  Employees e
  INNER JOIN Departments d ON e.Department = d.Code

Running query in 'sqlite:///mydb.db'

+-----------+-----------+-----------+------------+------+-----------------+--------+
|    SSN    |    Name   |  LastName | Department | Code |      Name_1     | Budget |
+-----------+-----------+-----------+------------+------+-----------------+--------+
| 123234877 |  Michael  |   Rogers  |     14     |  14  |        IT       | 65000  |
| 152934485 |   Anand   | Manikutty |     14     |  14  |        IT       | 65000  |
| 222364883 |   Carol   |   Smith   |     37     |  37  |    Accounting   | 15000  |
| 326587417 |    Joe    |  Stevens  |     37     |  37  |    Accounting   | 15000  |
| 332154719 | Mary-Anne |   Foster  |     14     |  14  |        IT       | 65000  |
| 332569843 |   George  |  ODonnell |     77     |  77  |     Research    | 55000  |
| 546523478 |    John   |    Doe    |     59     |  59  | Human Resources | 240000 |
| 631231482 |   David   |   Smith   |     77     |  77  |     Research    | 55000  |
| 654873219 |   Zacary  |   Efron   |     59     |  59  | Human Resources | 240000 |
| 745685214 |    Eric   | Goldsmith |     59     |  59  | Human Resources | 240000 |
+-----------+-----------+-----------+------------+------+-----------------+--------+
Truncated to displaylimit of 10.

In [25]:
%%sql
-- Select the name and last name of each employee, along with the name and budget of the employee's department.
SELECT
  e.Name,
  e.LastName,
  d.Name AS Department,
  d.Budget
FROM
  Employees e
  INNER JOIN Departments d ON e.Department = d.Code

Running query in 'sqlite:///mydb.db'

+-----------+-----------+-----------------+--------+
|    Name   |  LastName |    Department   | Budget |
+-----------+-----------+-----------------+--------+
|  Michael  |   Rogers  |        IT       | 65000  |
|   Anand   | Manikutty |        IT       | 65000  |
|   Carol   |   Smith   |    Accounting   | 15000  |
|    Joe    |  Stevens  |    Accounting   | 15000  |
| Mary-Anne |   Foster  |        IT       | 65000  |
|   George  |  ODonnell |     Research    | 55000  |
|    John   |    Doe    | Human Resources | 240000 |
|   David   |   Smith   |     Research    | 55000  |
|   Zacary  |   Efron   | Human Resources | 240000 |
|    Eric   | Goldsmith | Human Resources | 240000 |
+-----------+-----------+-----------------+--------+
Truncated to displaylimit of 10.

In [27]:
%%sql
-- Select the name and last name of employees working for departments with a budget greater than $60,000.
SELECT
  e.Name,
  e.LastName,
  d.Name AS Department,
  d.Budget
FROM
  Employees e
  INNER JOIN Departments d ON e.Department = d.Code
WHERE
  d.Budget >= 60000

Running query in 'sqlite:///mydb.db'

+-----------+-----------+-----------------+--------+
|    Name   |  LastName |    Department   | Budget |
+-----------+-----------+-----------------+--------+
|  Michael  |   Rogers  |        IT       | 65000  |
|   Anand   | Manikutty |        IT       | 65000  |
| Mary-Anne |   Foster  |        IT       | 65000  |
|    John   |    Doe    | Human Resources | 240000 |
|   Zacary  |   Efron   | Human Resources | 240000 |
|    Eric   | Goldsmith | Human Resources | 240000 |
| Elizabeth |    Doe    |        IT       | 65000  |
|   Kumar   |   Swamy   |        IT       | 65000  |
+-----------+-----------+-----------------+--------+

In [30]:
%%sql
-- Select the departments with a budget larger than the average budget of all the departments.
SELECT
  *
FROM
  Departments
WHERE
  Budget >= (
    SELECT
      AVG(Budget)
    FROM
      Departments
  )

Running query in 'sqlite:///mydb.db'

+------+-----------------+--------+
| Code |       Name      | Budget |
+------+-----------------+--------+
|  59  | Human Resources | 240000 |
+------+-----------------+--------+

In [39]:
%%sql
-- Select the names of departments with more than two employees
SELECT
  d.Name
FROM
  Departments d
  INNER JOIN Employees e ON d.Code = e.Department
GROUP BY
  e.Department
HAVING
  COUNT(*) > 2

Running query in 'sqlite:///mydb.db'

+-----------------+
|       Name      |
+-----------------+
|        IT       |
| Human Resources |
+-----------------+

In [ ]:
%%sql